package subtext.yuvallovenotes.crossapplication.database

import subtext.yuvallovenotes.crossapplication.models.loveitems.LoveClosure
import subtext.yuvallovenotes.crossapplication.models.loveitems.LoveOpener
import subtext.yuvallovenotes.crossapplication.models.loveitems.LovePhrase

internal object DefaultLoveDataSet {

    val openers = mutableListOf(
            LoveOpener("C48DB3DD-AFA7-4749-9FA9-A5109B98B958", "קסם שלי,"),
            LoveOpener("A86D69A7-D887-407B-A542-85F26591DBC3", "שושולולו שלי :)"),
            LoveOpener("4F8FD4A0-A8B3-44EE-AA76-DE23555CA748", "למקור היופי שלי,\uD83C\uDF3A"),
            LoveOpener("4F8FD4A0-A8B3-44EE-AA76-DE23555CA748", "פשפשית קטנה שלי,"),
            LoveOpener("7E0C3768-1DB2-459F-BBA8-812EBDB6BF37", "לחתולה שלי\uD83D\uDC31"),
            LoveOpener("2AD89DAF-25E7-413D-B76D-0DAEDC18B6FE", "גבשושית שלי,"),
            LoveOpener("FCCEC87A-B136-4CE9-9EA8-83F576E241F6", "חתולה יפה שלי,"),
            LoveOpener("D6BBE6EF-F22A-422F-9957-7F306052C2CB", "קושקושית קטנה,"),
            LoveOpener("E8458618-8822-4EB7-B509-986161029E93", "קושקושית שלי,"),
            LoveOpener("B2A574B0-2A9E-4F1A-833E-6D7D1A3A11B1", "לולרית שלי,"),
    )
    val phrases = mutableListOf(
            LovePhrase("E76B818C-E822-42B1-BE24-401D22BA9485",
"אם פגעתי אני מצטער, הקרבה בינינו מוציאה ממני רבדים שאינם יוצאים בדרך כלל, לאהבה ישנן דרכים משונות להתבטא לפעמים. אם נפגעת, כולי תקווה שתסלחי לי, כי היחסים שלנו ממשיכים קדימה, בסוף אנחנו יחד, אנחנו חוזרים אחד אל השניה וכל הפעמים בהן עשינו זאת בעבר עומדות לצידנו. אני אוהב אותך, אני רוצה לסלוח ולהיות נסלח, אני רוצה ששוב נהיה יחד, מחוברים בלבבות\uD83C\uDF31"),
            LovePhrase("C91387BE-33EF-4923-AA02-4B8FC13C9176", "ליחסים יש את המורכבות שלהם, בייחוד בכל הנוגע לאמירת האמת לבן הזוג. את אומרת לי את האמת, זו היפה וזו הכואבת, וגם כשהיא כואבת, בטווח הארוך היא תהיה בשירות של האהבה. כל עוד הכוונה שלך היא לבנות את שנינו, מילותייך יהיו בשירות האהבה. תמשיכי לומר לי את האמת אהובתי, אל תפחדי, אם אפגע אקום שוב, כמו שקמתי מאז ומתמיד. חוסר המודעות כואב הרבה יותר מאור הפלורסנט של מילים חושפניות, גם אם הן מציפות באותו הרגע. החיים לצידך הם הזדמנות לכוונן ולתאם את עצמי עד שהנוכחות שלי תהיה עוצמתית, גמישה וקשובה לרגע במלואו, לשם כך אני תמיד מחפש את האמת המזדקקת מתוך המפגש ביני ובינך."),
            LovePhrase("4858FAA7-73E6-4B4E-98BD-3A507A4957BC", "לאחר שנים שנהיה ביחד תישאר האהבה, זו הנבואה שלי, זו הידיעה שבגללה בחרתי בך ונבחרתי על ידך, כי ידענו. הרגשנו בשיחות הטלפון הארוכות וההתקרבות של משבר הקורונה, הבנו שכאן ננצא החיבור שיימשך, חזק יותר מהכוחות של כל הקשיים והמחלוקות והריבים. אנחנו קשורים זה בזה ומתקדמים יחד, לפעמים אני מושך קדימה, לפעמים את,  אך אין ספק שזה קדימה. כמה קל להבחין זאת, החיים שלי כל כך התקדמו כשאני יחד איתך ואני יודע שגם את מרגישה כך מהצד שלך. בואי נמשיך את זה מאמי, בואי ניתן לאהבה להעמיק עוד ועוד עם השנים, זו הנבואה שלי והיא מגשימה את עצמה \u2066\uD83C\uDF3A"),
            LovePhrase("76BE7C23-8E58-4890-8E5B-7F6BFC9C39D5", "נפש בריאה בגוף בריא, נפש בריאה בזוגיות בריאה. כאשר מגיע יום בו את מרגישה חלשה יותר, זוהי זכות להיות שם בשבילך, כי את הנסיכה המתוקה שלי ואותך אני אוהב. אני מברך אותך, שתרגישי טוב ושהגוף שלך יהיה קליל, כמו בד עדין הנופל בנחת על הבגד. אני תמיד כאן בשבילך, עם רצון אמיתי לעזוור ולתמוך, ויודע שאת תעשי את אותו הדבר בשבילי, וזה מה שחפה כל כך בשניים."),
            LovePhrase("0E1D32A1-3868-4E01-8EAE-E4AA711DBC43", "בתוך הזוגיות הכאבים שלנו צפים, קשיים רגשיים עולים ויורדים מן המצולות, כעסים מתפשטים כמו סופת טורנדו ואחר כך שוככים.אנחנו מעבירים אחד לשנייה את מה שטוב בחיים האלו ואת מה שקשה. אני יודע שלפעמים כואב לך איתי, כאשר אני אומר דברים שפוגעים בך ולאחר מכן נפגע בעצמי, כאשר רחמים עצמיים שולטים בכיפה.אך מנגד, אני גם יודע שטוב לנו ביחד, ולא בחרנו זה את זו במקרה, בחרנו כי חשנו חיבור עמוק וידענו שהאהבה תכה שורש, אם רק נאפשר לה - ופתחת בפניי את ליבך הקטן במטרה לאהוב, וגם אני עשיתי כך.קשה לריב, אני יודע, וקשה לסלוח על פגיעות שבמעמקים, אך הסליחה גם הכרחית על מנת שהשינוי המיוחל יוכל להיות, ואני מבקש את סליחתך על הצער שגרמתי לך, הייתי חסר רגישות.גם אם כרגע ליבך סגור, דעי שאני רואה בך שפע של תכונות טובות, שפע של זכויות. את טובת לב, ויש לך אנרגיה טובה, ונוכחות טובה, ורצון עמוק לאהוב באמת ולהיות נאהבת, והלב שלך יודע להיפתח, אפשר לראות את זה באכפתיות שלך מהחברות והמשפחה שלך ומאנשים במצוקה - אני אוהב את זה מאוד. והחיוך והצחוק שלך נותנים לי תחושה טובה כל כך :)גם אם זה ייקח זמן, גם אם את לא מרגישה שיש שינוי, דעי לך שאני מאוד רוצה להיות אדם טוב יותר, שיהיה לי פרגון רחב יותר ויותר אומץ ויותר הוקרת תודה על הדברים הטובים שבחיי, הוקרת תודה שאת בחיים שלי.אני מצטער על מה שנעשה,אני אוהב אותך ומקווה שהלבבות שלנו ישובו להיות יחד, כי גם הם רוצים להיות יחד."),
            LovePhrase("752EBE85-1DAC-454E-93CF-F3B7933B1676", "אני רוצה אותך כאישה ואת רוצה אותי כגבר, אך מה לגבי האיזון בין השניים? כל אחד מאיתנו רוצה שהשני יתאזן, יעבוד על עצמו. אין ספק שהצפת הפגמים היא דבר כואב, זה כואב לדעת לגבי המקומות בהם אני נכשל. כואבת אפילו יותר הידיעה שעצם החשיפה גורמת לי לאבד את שיווי המשקל שלי. אך סוד כוחנו טמון בהמשך הצעידה קדימה, למרות הקשיים אנחנו יכולים לעשות את זה. אני יכול לדייק את התקשורת,  לבסס הרגלים חדשים, את יכולה להתמודד עם הפחדים, הוכחנו את זה בעבר ואני יודע שאנחנו מתקדמים למעלה - יורדים ועולים ויורדים, אבל כל פעם עוד קצת ליחסים שלמים ומלאים יותר."),
            LovePhrase("0E358337-5EAF-439A-9DC4-0246A33D872E", "ניקית את הבית, סידרת את ארון הבגדים, את מגבות המטבח, את התמרוקים במקלחת. כל יום בו את עושה צעד קטן קדימה הוא יום של חגיגה לזוגיות שלנו. כגבר שלך זהו תפקידי - לעודד אותך, ולאפשר לך ללכת בדרך הנכונה ביותר בעבורך. כשאת צועדת אני מחייך בתוך ליבי, ומערכת היחסים עולה למעלה.."),
            LovePhrase("FCF9233B-353E-484E-98CB-4A8AB318BB1A", "את הנחל שזורם בתוך נפשי, והצ'לו שבקולך מלווה את תנועת המים, וגם בשעה שתיחלש היא איננה עוצרת. עולמי נפתח דרך הפגיעות שלך.את הנחל שזורם בתוך ליביובחדרי חדרים אני עוטף אותך, וחש את פכפוך תחושותיך, אותן את מציעה לי כמו גלים, נפרסים מאחורי כל מילה ומשפט ושיחה של ליל שבת.איזו עוד תחושה יש כמו לגלות שאני אוהב אותך? \u2066"),
            LovePhrase("4CAE7D8B-4F33-4A84-BDB9-DB668A77F0E3", "כל הזוגות רבים.זוהי הקלישאה, המשפט אשר נאמר בעשרת אלפים ווריאציות ועדיין משמש אותנו נאמנה, כמו החפצים של פעם שלא היו נהרסים גם לאורך שנים. אולי השאלה היא לא האם נריב או כמה נריב, אלא האם נלמד לריב באהבה ולהשלים באהבה, גם אם יידרשו שנים של אימון. אולי האהבה מתבטאת בצבע ובתחושה של הריבים שלנו? אולי בכמות הזמן שלוקח לנו ללמוד ולשנות את מה שדורש שינוי? כך או כך אני חושב בכנות שאנחנו עושים דרך יחד. אהבתינו יקרה לשנינו, היא מעמיקה עם הזמן ואנחנו מחוייבים אליה, היא עושה לנו טוב ומוליכה אותנו בכיוון הנכון. אני רוצה להמשיך איתך בשביל הזה מתוקה שלי, רוצה ומתחייב בכנות, כזו הנובעת מן המעמקים שבפנים.\u2066"),
            LovePhrase("4EE43987-B4ED-404B-B089-E0789BF1B764", "להיות בשקט - זאת תלמדי אותי. להגיע לעיקר הדברים, למצוא את המילים האותנטיות, להעביר את הקשב לרמזים עדינים של הרגע הנוכחי. אך השקט הוא מעבר לכל אלו, שכן כשם שאת ממלאת את המרחב הזוגי באיכות של רגשותייך ותשוקתך, את מוצאת את ההשלמה לכך באיכות של השקט. השקט אותו אני מפתח כאשר אני לומד ממך באלפי דרכים שונות.\u2066"),
    )
    val closures = mutableListOf(
            LoveClosure("4B9BEB6B-5E16-46EF-BBF1-14ACBC9AC0A9", "הלב שלי שלך\u2066❤️\u2069"),
            LoveClosure("5EA7E6BE-5235-4FFA-B31F-1E3F58BF38F3", "החתול שלך"),
            LoveClosure("DD5CE74F-71DF-4656-9304-76AF5A390F73", "אני ❤️"),
            LoveClosure("EB74FB15-DA4F-4E10-8EA3-338126B88E17", "אני אוהב אותך מתוקה שלי"),
            LoveClosure("EEC2799D-5988-4E73-914E-DA59C1AB2469", "אני מודה לך."),
            LoveClosure("5E47D20D-7882-443F-9817-6748E42CD563", "מודה על מה שיש בינינו"),
            LoveClosure("8AA0D780-6582-42D9-8ED1-17423EE25959", "תודה על מי שאת."),
            LoveClosure("7979C795-31FD-46D2-90A8-907EE43FF5D8", "וואלה, זכיתי."),
            LoveClosure("EFC0A18A-A15B-4448-B4E7-F3C0BFE247B1", "אוהב,גמל השלמה שלך."),
    )
}
