package subtext.yuvallovenotes.crossapplication.database.initialdataset

import subtext.yuvallovenotes.crossapplication.models.loveitems.LoveClosure
import subtext.yuvallovenotes.crossapplication.models.loveitems.LoveLetter
import subtext.yuvallovenotes.crossapplication.models.loveitems.LoveOpener
import subtext.yuvallovenotes.crossapplication.models.loveitems.LovePhrase

internal object ArielDefaultLoveDataSetInitial : InitialLettersDataSet {

    private val letters: MutableList<LoveLetter> = mutableListOf()

    private val openers: MutableList<LoveOpener> = mutableListOf(
            LoveOpener("C48DB3DD-AFA7-4749-9FA9-A5109B98B958", "קסם שלי,"),
            LoveOpener("A86D69A7-D887-407B-A542-85F26591DBC3", "שושולולו שלי :)"),
            LoveOpener("4F8FD4A0-A8B3-44EE-AA76-DE23555CA748", "למקור היופי שלי,\uD83C\uDF3A"),
            LoveOpener("4F8FD4A0-A8B3-44EE-AA76-DE23555CA748", "פשפשית קטנה שלי,"),
            LoveOpener("7E0C3768-1DB2-459F-BBA8-812EBDB6BF37", "לחתולה שלי\uD83D\uDC31"),
            LoveOpener("2AD89DAF-25E7-413D-B76D-0DAEDC18B6FE", "גבשושית שלי,"),
            LoveOpener("FCCEC87A-B136-4CE9-9EA8-83F576E241F6", "חתולה יפה שלי,"),
            LoveOpener("D6BBE6EF-F22A-422F-9957-7F306052C2CB", "קושקושית קטנה,"),
            LoveOpener("E8458618-8822-4EB7-B509-986161029E93", "קושקושית שלי,"),
            LoveOpener("B2A574B0-2A9E-4F1A-833E-6D7D1A3A11B1", "לולרית שלי,"),
            LoveOpener("21569B6F-07CC-41FC-94FF-86B6EA1B39C8", " עורב שלי,"),
            LoveOpener("418D27E5-5BFA-4848-B5F1-7DADF70B0AB9", "  נשמה כפרה מאמי,"),
            LoveOpener("05D972CB-7385-40E5-9E37-5F8BAA0B4D4A", " אהבה שלי,"),
            LoveOpener("4E6485D5-23B6-4F81-9EF2-97233C9E6156", "פושושית קטנה שלי"),
            LoveOpener("422DF532-CD66-48CE-B8A0-9EA3CDE7BD76", "רציתי לספר לך משהו"),
            LoveOpener("1B7EC9DA-9335-46AE-8CF9-6C7DB4CE522B", "שושו שלי"),
            LoveOpener("FDD1867B-AF1E-4575-A5F7-32D15643E956", "בובי קטנה,"),
            LoveOpener("C9E3C519-1801-4311-BE1E-F0AB4EED78DC", "בובונת,"),
            LoveOpener("28C892A4-F9F1-49F3-A1FA-FFCAEB4DED47", "מישמיש שלי,"),
            LoveOpener("75CA7048-8D5E-4F09-9F84-5595CDAA96D2", "ליצ'י שלי,"),
            LoveOpener("C8572189-E163-4364-9EF4-6D62804C359F", "לאישה היפה,"),
            LoveOpener("89A6966C-BB7E-46BB-95A7-70A24856BF5A", "אהובתי מתוקתי,"),
            LoveOpener("3B80F36F-633F-48F7-A3E7-EB62A8E0BE56", "אישה שלי,"),
            LoveOpener("DBFFB327-BCC7-4D99-88BB-B4B04CC48411", "בובית יפה שלי,"),
            LoveOpener("F71BDAD4-42F7-4411-A59D-B650669DA9E2", "מגבת שלי,"),
            LoveOpener("0635BE66-E84E-4EF4-BF2C-B78EABA23418", "חתולה שלי,"),
            LoveOpener("5B9E86F7-6710-472C-8B55-4CCE9B41E513", "עצלנית שלי,"),
            LoveOpener("0EDD5B6C-38E6-4D58-B1E7-3B83371A5180", "מהממת שלי,"),
            LoveOpener("55CC102D-0EE3-424B-AE70-4243E8CDFE7F", "מקסימונת שלי,"),
            LoveOpener("96BC3FB2-04CA-483C-A0DB-D8A364D4089C", "פרח יפה שלי,"),
            LoveOpener("174DF457-E649-4929-8576-301382951A29", "יקירתי,"),
            LoveOpener("174DF457-E649-4929-8576-301382951A29", "יקירתי,"),
            LoveOpener("CAD5D588-3053-4377-AFE5-530FED60AA30", "שמש שלי,"),
            LoveOpener("D8A2D7E4-17D8-408B-84C0-7D1726DBDC29", "נסיכה שלי,"),
            LoveOpener("5A9C4B22-12AD-43B8-A837-5919F3BAF4F1", "מתוקה שלי,"),
            LoveOpener("71D7C1E4-BE4E-4B25-A856-FE528BF4C6A0", "אהובתי שלי,"),
            LoveOpener("EBD65F81-AFE4-422C-B9C6-5964120D05B2", "בובי,"),
            LoveOpener("ED238A8C-CCCB-4D38-AD89-9483D0B55CF3", " אישה יקרה שלי,"),
            LoveOpener("5F1ED6F3-A7EB-45B8-A261-03D13B14AD84", "יובל המקסימה,"),
            LoveOpener("9C8C1B65-4AD6-42B6-99B8-FA7F4A8C8D84", "יפה שלי,"),
            LoveOpener("C7B75367-3FF2-49F3-A4F5-C71AB5F2D97C", "יפתי"),
            LoveOpener("A4B23797-2CA1-12F3-B1B5-D31AB5F2D97C", "חסחוס שלי"))

    private val phrases = mutableListOf(
            LovePhrase("E76B818C-E822-42B1-BE24-401D22BA9485",
                    "אם פגעתי אני מצטער, הקרבה בינינו מוציאה ממני רבדים שאינם יוצאים בדרך כלל, לאהבה ישנן דרכים משונות להתבטא לפעמים. אם נפגעת, כולי תקווה שתסלחי לי, כי היחסים שלנו ממשיכים קדימה, בסוף אנחנו יחד, אנחנו חוזרים אחד אל השניה וכל הפעמים בהן עשינו זאת בעבר עומדות לצידנו. אני אוהב אותך, אני רוצה לסלוח ולהיות נסלח, אני רוצה ששוב נהיה יחד, מחוברים בלבבות\uD83C\uDF31"),
            LovePhrase("C91387BE-33EF-4923-AA02-4B8FC13C9176", "ליחסים יש את המורכבות שלהם, בייחוד בכל הנוגע לאמירת האמת לבן הזוג. את אומרת לי את האמת, זו היפה וזו הכואבת, וגם כשהיא כואבת, בטווח הארוך היא תהיה בשירות של האהבה. כל עוד הכוונה שלך היא לבנות את שנינו, מילותייך יהיו בשירות האהבה. תמשיכי לומר לי את האמת אהובתי, אל תפחדי, אם אפגע אקום שוב, כמו שקמתי מאז ומתמיד. חוסר המודעות כואב הרבה יותר מאור הפלורסנט של מילים חושפניות, גם אם הן מציפות באותו הרגע. החיים לצידך הם הזדמנות לכוונן ולתאם את עצמי עד שהנוכחות שלי תהיה עוצמתית, גמישה וקשובה לרגע במלואו, לשם כך אני תמיד מחפש את האמת המזדקקת מתוך המפגש ביני ובינך."),
            LovePhrase("4858FAA7-73E6-4B4E-98BD-3A507A4957BC", "לאחר שנים שנהיה ביחד תישאר האהבה, זו הנבואה שלי, זו הידיעה שבגללה בחרתי בך ונבחרתי על ידך, כי ידענו. הרגשנו בשיחות הטלפון הארוכות וההתקרבות של משבר הקורונה, הבנו שכאן ננצא החיבור שיימשך, חזק יותר מהכוחות של כל הקשיים והמחלוקות והריבים. אנחנו קשורים זה בזה ומתקדמים יחד, לפעמים אני מושך קדימה, לפעמים את,  אך אין ספק שזה קדימה. כמה קל להבחין זאת, החיים שלי כל כך התקדמו כשאני יחד איתך ואני יודע שגם את מרגישה כך מהצד שלך. בואי נמשיך את זה מאמי, בואי ניתן לאהבה להעמיק עוד ועוד עם השנים, זו הנבואה שלי והיא מגשימה את עצמה \u2066\uD83C\uDF3A"),
            LovePhrase("76BE7C23-8E58-4890-8E5B-7F6BFC9C39D5", "נפש בריאה בגוף בריא, נפש בריאה בזוגיות בריאה. כאשר מגיע יום בו את מרגישה חלשה יותר, זוהי זכות להיות שם בשבילך, כי את הנסיכה המתוקה שלי ואותך אני אוהב. אני מברך אותך, שתרגישי טוב ושהגוף שלך יהיה קליל, כמו בד עדין הנופל בנחת על הבגד. אני תמיד כאן בשבילך, עם רצון אמיתי לעזוור ולתמוך, ויודע שאת תעשי את אותו הדבר בשבילי, וזה מה שחפה כל כך בשניים."),
            LovePhrase("0E1D32A1-3868-4E01-8EAE-E4AA711DBC43", "בתוך הזוגיות הכאבים שלנו צפים, קשיים רגשיים עולים ויורדים מן המצולות, כעסים מתפשטים כמו סופת טורנדו ואחר כך שוככים.אנחנו מעבירים אחד לשנייה את מה שטוב בחיים האלו ואת מה שקשה. אני יודע שלפעמים כואב לך איתי, כאשר אני אומר דברים שפוגעים בך ולאחר מכן נפגע בעצמי, כאשר רחמים עצמיים שולטים בכיפה.אך מנגד, אני גם יודע שטוב לנו ביחד, ולא בחרנו זה את זו במקרה, בחרנו כי חשנו חיבור עמוק וידענו שהאהבה תכה שורש, אם רק נאפשר לה - ופתחת בפניי את ליבך הקטן במטרה לאהוב, וגם אני עשיתי כך.קשה לריב, אני יודע, וקשה לסלוח על פגיעות שבמעמקים, אך הסליחה גם הכרחית על מנת שהשינוי המיוחל יוכל להיות, ואני מבקש את סליחתך על הצער שגרמתי לך, הייתי חסר רגישות.גם אם כרגע ליבך סגור, דעי שאני רואה בך שפע של תכונות טובות, שפע של זכויות. את טובת לב, ויש לך אנרגיה טובה, ונוכחות טובה, ורצון עמוק לאהוב באמת ולהיות נאהבת, והלב שלך יודע להיפתח, אפשר לראות את זה באכפתיות שלך מהחברות והמשפחה שלך ומאנשים במצוקה - אני אוהב את זה מאוד. והחיוך והצחוק שלך נותנים לי תחושה טובה כל כך :)גם אם זה ייקח זמן, גם אם את לא מרגישה שיש שינוי, דעי לך שאני מאוד רוצה להיות אדם טוב יותר, שיהיה לי פרגון רחב יותר ויותר אומץ ויותר הוקרת תודה על הדברים הטובים שבחיי, הוקרת תודה שאת בחיים שלי.אני מצטער על מה שנעשה,אני אוהב אותך ומקווה שהלבבות שלנו ישובו להיות יחד, כי גם הם רוצים להיות יחד."),
            LovePhrase("752EBE85-1DAC-454E-93CF-F3B7933B1676", "אני רוצה אותך כאישה ואת רוצה אותי כגבר, אך מה לגבי האיזון בין השניים? כל אחד מאיתנו רוצה שהשני יתאזן, יעבוד על עצמו. אין ספק שהצפת הפגמים היא דבר כואב, זה כואב לדעת לגבי המקומות בהם אני נכשל. כואבת אפילו יותר הידיעה שעצם החשיפה גורמת לי לאבד את שיווי המשקל שלי. אך סוד כוחנו טמון בהמשך הצעידה קדימה, למרות הקשיים אנחנו יכולים לעשות את זה. אני יכול לדייק את התקשורת,  לבסס הרגלים חדשים, את יכולה להתמודד עם הפחדים, הוכחנו את זה בעבר ואני יודע שאנחנו מתקדמים למעלה - יורדים ועולים ויורדים, אבל כל פעם עוד קצת ליחסים שלמים ומלאים יותר."),
            LovePhrase("0E358337-5EAF-439A-9DC4-0246A33D872E", "ניקית את הבית, סידרת את ארון הבגדים, את מגבות המטבח, את התמרוקים במקלחת. כל יום בו את עושה צעד קטן קדימה הוא יום של חגיגה לזוגיות שלנו. כגבר שלך זהו תפקידי - לעודד אותך, ולאפשר לך ללכת בדרך הנכונה ביותר בעבורך. כשאת צועדת אני מחייך בתוך ליבי, ומערכת היחסים עולה למעלה.."),
            LovePhrase("FCF9233B-353E-484E-98CB-4A8AB318BB1A", "את הנחל שזורם בתוך נפשי, והצ'לו שבקולך מלווה את תנועת המים, וגם בשעה שתיחלש היא איננה עוצרת. עולמי נפתח דרך הפגיעות שלך.את הנחל שזורם בתוך ליביובחדרי חדרים אני עוטף אותך, וחש את פכפוך תחושותיך, אותן את מציעה לי כמו גלים, נפרסים מאחורי כל מילה ומשפט ושיחה של ליל שבת.איזו עוד תחושה יש כמו לגלות שאני אוהב אותך? \u2066"),
            LovePhrase("4CAE7D8B-4F33-4A84-BDB9-DB668A77F0E3", "כל הזוגות רבים.זוהי הקלישאה, המשפט אשר נאמר בעשרת אלפים ווריאציות ועדיין משמש אותנו נאמנה, כמו החפצים של פעם שלא היו נהרסים גם לאורך שנים. אולי השאלה היא לא האם נריב או כמה נריב, אלא האם נלמד לריב באהבה ולהשלים באהבה, גם אם יידרשו שנים של אימון. אולי האהבה מתבטאת בצבע ובתחושה של הריבים שלנו? אולי בכמות הזמן שלוקח לנו ללמוד ולשנות את מה שדורש שינוי? כך או כך אני חושב בכנות שאנחנו עושים דרך יחד. אהבתינו יקרה לשנינו, היא מעמיקה עם הזמן ואנחנו מחוייבים אליה, היא עושה לנו טוב ומוליכה אותנו בכיוון הנכון. אני רוצה להמשיך איתך בשביל הזה מתוקה שלי, רוצה ומתחייב בכנות, כזו הנובעת מן המעמקים שבפנים.\u2066"),
            LovePhrase("4EE43987-B4ED-404B-B089-E0789BF1B764", "להיות בשקט - זאת תלמדי אותי. להגיע לעיקר הדברים, למצוא את המילים האותנטיות, להעביר את הקשב לרמזים עדינים של הרגע הנוכחי. אך השקט הוא מעבר לכל אלו, שכן כשם שאת ממלאת את המרחב הזוגי באיכות של רגשותייך ותשוקתך, את מוצאת את ההשלמה לכך באיכות של השקט. השקט אותו אני מפתח כאשר אני לומד ממך באלפי דרכים שונות.\u2066"),
            LovePhrase("46D528D9-5345-4B7E-8D15-2CA041595FC1", "את משנה אותי מבפנים. התהליך הזה אמנם איטי, איננו ניכר מיידית, אך הוא מתרחש כמו צמח הגדל לאט בין קרני השמש. את התזונה של חיי ומתוכך אני מוצא את החומר הדרוש להתפתחותי. אני מטמיע את מילותייך, את רגשותייך, את תובנותייך ותשוקתך. דרך האושר והכאב שבלהיות איתך משהו טוב יותר גדל מתוכי החוצה.\u2066"),
            LovePhrase("9942CA43-729D-443B-A1FE-7A640DE5E8D8", "לעיתים הקשיים מגיעים אל פסגה חדשה, ובד בבד הם חושפים את עומקו של הקשר שלנו. אנשים של אמת אנחנו, ולכן אנו מחפשים אותה, דנים בה, מנסים לתפוס אותה בחמקמקותה היחסית והמוחלטת. הקשר שלנו מונח על רעיונות ורגשות יסודיים של משיכה ונאמנות. אף כי נוטים אנו להרהר אותם ולגעת בהם ישירות, העיסוק בהם גם מעמיק אותם, כמו עץ ששורשיו מסתעפים הצידה ולמטה. המגע בשורשי הקשר מקנה לנו סבל ופיכחון וחוכמה חדשה, הוא מתווה דרך לצמיחה שלנו. שם, במחשכיה של הבעיה המונחת על השולחן, בקרקעית הים איפה שהאוויר מתחיל לאזול, שם יש אפשרות גם למצוא את האוצר בדמות של תובנה והסכם חדש ופעולות אמיצות לחיזוק הזוגיות - האוצרות שנמצאים בקרקעית סופם שיחזקו את עמודי היסוד של הקשר.\u2066"),
            LovePhrase("93FCAFE2-A923-4F6F-A0C1-7E4BABE5DDAA", "כל הנהרות זורמים אל הים, וכל המחלוקות נובעות מאותו השורש, וגילויי אהבתנו מגיעים מאותו המקור. אני נפגע ממך כי אני אוהב אותך ואת כועסת עליי כי את אוהבת אותי. אנחנו כאן כדי להתענג ולבכות וללמוד משהו. אני אוהב אותך גם כשכואב לי, גם כשאני תקוע בכלא זכוכית של בדידות ולא רוצה לצאת, עמוק בתוך מיכל העצבות שוכן הרצון העז להתחבר איתך, לדבוק בך עד שנהיה לבשר אחד שעשוי משני אנשים שלמים ומוגשמים.\u2066"),
            LovePhrase("DD7B03FE-70E2-4C61-A1FE-2FF975FD95FD", "אני צופה בך לפעמים כשאת ישנה, מכורבלת בתוך השמיכה, ורואה מלאכית קטנה. עינייך עצומות, הריסים מרפרפים בין החלומות. אני מתבונן בתשומת לב ויודע שאת שלי, ובא לחבק אותך. "),
            LovePhrase("B843A7A2-D5B7-48B1-985C-353A5C9F6B50", "לעמוד מאחורייך,להחזיק בידיים,ולהקשיב לגלים המתנפצים בתוך ליבך.לחישה באוזן,חיוך של קיץ,ועט שעם מקשט יומן סודי.אם חשקה נפשך להתמלאהניחי לה לשכון בתוכי,ותני לאהבה לפרוח במקומות מדושנים. "),
            LovePhrase("E0184F58-36B4-488B-8105-7B419A0F6D77", "האהבה שלנו צומחת כמו פרח בר, ונפתחת משיחה לשיחה, ממכתב למכתב, מחיבוק לחיבוק, מלחישה ללחישה..בתוך כל זה אני שמח ונרגש לחדור בהתמדה ישר לתוך ליבך, ולהודיע לך שהגעתי אליו על מנת להישאר.."),
            LovePhrase("420428BA-93D2-43E3-B096-872830B2C7B7", "התנועות הפיזיות והנפשיות שלך מעוררות אותי לחיים, מחדדות את הנוכחות שלי, מזיזות את הלב שלי שמוקסם מההתגלמות שלך.אז אני לוחש לך באלף דרכים שאני אוהב אותך, שאת יפה, ושמגיעה לך אהבה שלמה בחיים האלו,והעונג ממלא את ליבך ומשם חודר דרך הקליפה אל החזה והבטן והירכיים והמצח, כל הגוף חש את החום של האהבה..."),
            LovePhrase("A18BA117-80D4-4A59-8895-452CB5D0C146", "המהות הנשית שלך רק ביקשה לבקוע מבעד לקליפות, וכשאני עוטף אותך היא יכולה לצאת סופסוף, בקצב שלה.. בהתחלה גיששנו וזה טבעיאבל עכשיו כשאנחנו קרובים באמת אני אוהב כל כך ללחוש לתוכך איך את גורמת לי להרגיש.."),
            LovePhrase("65479DAF-7F53-4B9E-9DB5-D4474B20A2C0", "איזה כיף שכיף!דרך המשפט הזה את רומזת, שמבלי קשר לאירוע שכעת אנחנו חווים יחד את נהנית מהמסגרת הכוללת של היחסים בו הוא מתרחש. ובמילים פשוטות, כיף לך שנעים לנו. אז תדעי שגם לי נעים. כיף לי שאנחנו מסתדרים, כיף לי שאנחנו צוחקים וכיף לי כשאנחנו יכולים פשוט לשבת יחד על הספה ביום רביעי בבוקר ולהיות יחד באופן הטבעי ביותר שאני מכיר. כיף לי שבחרתי בך."),
            LovePhrase("6A3369B3-3D0C-45C4-871A-31464553D187", "את הסימן הטוב של חיי, האות לכך שהדברים מתכנסים אל תוך מסלול נכון. בתור אישתי את מהווה גורם מקרקע, עוגן ומשענת רגשית ופיזית לאורך מסלול משותף, המקודש בברית הנישואין. המחויבות שלנו היא השלם שעולה על סך חלקיו, בסיס ממנו אני יוצא אל העולם בבוקר, ומקום לנוח בו בעת הצורך. אני מודה לך על השמחה שאת מביאה אל חיי, ועל כך שאת מלמדת אותי דברים חדשים על עצמי. נוכחותך ומילותייך עוזרות לי להפוך לאדם מודע יותר ובעל יכולת גבוהה יותר בתחומים החזקים שלי, ולקחת את האחריות הדרושה בתחומים בהם אני חלש יותר."),
            LovePhrase("4C1A78EC-AF57-49FB-8BB6-B99A3FD5FEDC", "את המאמי של חיי. אילולא הייתי מכיר את הנפשות הפועלות הייתי חושב שזוהי שורה בשיר שמישהו פרסם יחד עם תמונה באינסטגרם, אך לא, זוהי אמירה אישית. ההבדל בין השתיים הוא תהומי, האחת נכתבת משיקולים פומביים של פופולריות והשנייה קשורה באופן בל ינותק עם פנימיות הלב. כאשר אני אומר שאת המאמי של חיי, את יכולה להרגיש בליבך המתוק את הבחירה האישית ביותר שלי בחיי האהבה שלנו."),
            LovePhrase("D805875D-1B27-4167-B6A8-5AD54218A81C", "אשת חיל מי ימצא? מישהי הפנימה את המסר, ואת האישה היחידה במרחב הזה שלנו. אני יושב ומתבונן בתמונה התלויה על לוח ההשראה שלנו, היא מלאת פרחים. כל פרח מסמל חלק מן השפע והאפשרויות שאת פותחת בחיי. היכן עוד תופיעי? אשת חיל..."),
            LovePhrase("99D2B2A5-872A-4B4F-9FFE-233621639819", "ההחלטה שלנו לקשור את חיינו זה בזו ממלאת אותנו מחד, ומאידך מותירה בתוכנו מקום לעשות דברים נוספים, אליהם לא היה לנו פנאי בטרם הכרנו. החיים לצידך הם העלייה המסלול הנכון בשבילי, מסלול המוביל אותי קדימה, מאפשר לי ללמוד, ולפתח את אותם הרעיונות והחלומות שאני מרגיש שעליי להגשים. על כך אני מקדיש לך את ההודיה שלי."),
            LovePhrase("BECA2D0A-8D6E-4ED2-B639-7A3CAA5C474A", "כל יום הוא הזדמנות לומר תודה, לברך על כך שאת לצידי, להשתאות בפני מי הנהר הזורמים בין גדותיי. את עושה מאמצים אמיתיים על מנת שיהיה לנו טוב, בונה את הבית מבפנים ומרעיפה עליו שפע. כאשר אני עייף את מציעה לי מרגוע וכשאני עצוב, חיבוקך הוא הנחמה המעודדת. ברכותייך הרבות בונות חיוניות, וכשאני נרגע אל תוכן אני בוחר בך בשמחה, בכל יום מחדש."),
            LovePhrase("B6F020DE-E11F-4FDA-9E4F-C08CB5E086E0", "מי החתולה שלי? מי אוהבת לשחק? מי אוכלת איתי אינג'רה כפולה שהופכת הליכה ברחוב לריצת מרתון? מי זו השושו-לולו שאני מחבק בקיצו של יום? זרם אינסופי של שאלות חיבה פורץ מתוכך אל אלו שאת אוהבת, ולפעמים הוא גם שוטף אותי כמו מקלחת חמימה בבית. היום הוא חוזר אלייך בחזרה."),
            LovePhrase("862E30D8-B4A6-43D6-BD4D-CA10121DD2B1", "ביתי הוא הנצח, המהות שלי שוכנת בבטחה מחוץ לעולם הזה. אך אין זהו הדין לגבייך. את נמצאת בתנועה מתמדת, משתנה כל העת, נעה מעצב לאהבה ומכעס לשמחה, רוקדת לאורך נהר של מילים וחיבוקים. האיחוד שלנו יוצר את השלם, כאשר הריקות חסרת הצורה שלי חודרת לתוך הקיום הבלתי פוסק שלך, נוצר עולם ובתוכו חיים ותודעה. הקשר שלנו הוא מימוש מופתי של הריקוד הנצחי בין גבר לאישה, זכר ונקבה."),
            LovePhrase("AF922794-D565-4652-83B0-A27483C66EA5", "הדיאלוג ממיס את חומות ליבי. כך אמרתי לך בעיצומו של דיון פתוח, כששוב חשפנו את רגשותינו. כוחנו טמון ביכולת שלנו לשוחח, להעניק תשומת לב, לשמוע את נקודת המבט המשלימה לשלנו. כל דיאלוג טוב מקרב אותנו צעד אחד נוסף זה לזו, כמו במשחק ששיחקנו פעם. דרך שיחה כנה אנו מסירים את שכבות ההגנה ונותרים פגיעים זה מול זו. העמידה הזו במערומינו, חשופי לבב מול מראת הזוגיות, משמרת את להבת אהבתינו, ותשמר אותה גם בעוד שנים רבות."),
            LovePhrase("A8F94709-122B-4EBD-8FE0-3666DE81B992", "בתוככי נפשך קיים חיבור לאיתני הטבע, אל הרוחות והאש והמים. כל האנרגיות האלו נובעות מתוך המקור שלך, בתוכך את יודעת שהן שם. באמצעות ליבך הפתוח את מביאה מזור לכאב שלי, דרך ההתמסרות שלך אני יכול למצוא דווקא את השקט שבתוכי."),
            LovePhrase("FAF2EDB7-390E-4E56-A34A-D842A976B35E", "גם בשיאו של יום חול אין זה מאוחר מידי לומר זאת.אני אוהב אותך.אוהב ומוכן ללכת איתך בדרכים פתלתלות, להתגבר על מכשולים וללמוד עליי ועלייך את כל אשר נדרש בכדי לקיים זוגיות מאושרת ובעלת משמעות. את אור של שמחה ושל יופי בחיי."),
            LovePhrase("CF5EDC32-DEE7-420A-9845-CBDAE653698F", "פרפרים ופרחים וילדים משחקים. מסביב מרחב של שקט, ובפנים הרבה נחת. בליבך הג'ינג'י יש מרחב בלתי נדלה של רעיונות, של צורות, של סיפורים וזכרונות, משורבטים ברציפות בצבעים של אהבתך.את הקסם שבחיי, מילותיי ופעולותיי ומאמציי מוקדשים לך - כי את מזינה ומרפאת ומאפשרת לי לחדש אותם בהנאה. בזכותך אני מוצא מקורות חדשים של נתינה והם יוצאים במעגלים אלינו ואל העולם."),
            LovePhrase("54C49EB1-E400-4B5E-8602-F49CE13544E5", "הטופו הוקפץ, הבמיה מתרככת לאיטה והבלנדר עובד. הבית נקי, העציצים כבר הושקו ובבר מנמנמת בהנאה על הספה. אנחנו מתנשקים בשקט. זוהי תמונת חיים, שגרה של זוג שבונה את ביתו ומאפשר לאהבתו לחשוף את עצמה בתוך כל הפעולות הקטנות שנועדו לתמוך ולהחזיק אותה. זוהי אמנות חיינו, וככל שעובר הזמן היא מעמיקה והולכת. אני מאחל לנו שנים רבות של הליכה משותפת בנתיב של זוגיות יפיפייה ומשפחה משגשגת."),
            LovePhrase("CF13EAC9-5C7B-42DD-8725-95F553741918", "הגיע הזמן שלי להוקיר לך תודה על מי שאת ועל מה שאת מביאה איתך ליחסים שלנו. החיים לצידך מלאים בהתרחשות אך גם מלאים בשקט.השקט לדעת שיהיה אוכל על השולחן.השקט לדעת שהמשפחה והחברים שלי יעריכו אותך.השקט לדעת שאני יקר לליבך.השקט לדעת שאנרגיה משיבת נעורים תמלא את היחסים שלנו.את פותחת בפניי את השפע שיש לעולם הזה להציע  ובזכותך אני זוכה לגדול ולהתפתח כגבר בדרך האמיצה של היחסים שלנו."),
            LovePhrase("AFABFB47-8569-4997-8C9B-61BA2C0A0E07", "אני יושב בחדר המשותף שלנו ויודע שיש לי אישה טובה, נאמנה, המשפיעה עליי ברכות רבות. להיות איתך זו אחת הזכויות החשובות שקיבלתי בחיי, יש בה עונג וכאב, שמחה ותבונה - זו מערכת יחסים אמיתית."),
            LovePhrase("41F4C425-BEEC-4CEF-9E5E-0CC1E8129EBB", "את פשפשית קטנה שלי, מקור בלתי נדלה של אנרגיית חיים, של התרחשות. הצבע שלך ניתז על הקנבס שלי, מותיר חותם בנפשי. ציירי בתוכי את הציור שלך! שפע של צורות גמישות, צבעוניות, מעורבבות יחד כמו התחושות שיוצאות מאיתנו בעיצומו של חיבוק לילי."),
            LovePhrase("82A672F6-B4C1-49E6-BD2B-FA0F24DE51FB", "במיוחד ברגעים פשוטים של ישיבה על הספה, כאשר כל תשומת ליבנו מופנית זה כלפיי זו, ניכר חוזקה של מערכת היחסים הזו - כיף לנו להיות יחד. אני מאחל לנו לשמור את הכיף הזה, שכן היכולת להיות יחד בפשטות מחזקת את הקשר, מחברת אותנו."),
            LovePhrase("C5D55E7F-E531-400D-B2CE-D07B0F37AC2B", "כל יום הוא שיר חדש המתנגן בתוכי, ואת הנבל, מפיקה את הצליל. הקהל הפנימי מאזין למוזיקה היוצאת, הנשמעת כאשר אצבעותיי פורטות על מיתרייך האדמוניים. וכאשר הצלילים מהדהדים בפנים אני יודע שהיחסים שלנו הם אמנות עדינה של אהבה, תקשורת ותשומת לב. תפילתי היא שייצאו עוד מנגינות רבות מהמגע שביני ובינך."),
            LovePhrase("8B33A9BA-35CC-4860-8394-023CA4FC807A", "התעוררנו בבוקר וחייכת אליי, ושוב תחושה עדינה של אושר מברכת אותי לקראת יום חדש. בתוכי אני יודע שמעבר לאוכל הטעים, לניקיון, לכביסה ולמפגשים החברתיים, זו המהות הנשית שלך בה חושקת נפשי. היא תמיד שם, חבויה מאחורי פעולות היומיום, כמו פרח יפה המוגן בינות עצי היער. הברכה הזו היא היא הסיבה לאהבתי, והיא מי שאת בעומק הוויתך. אל מהותך הנשית אני מכוון את מבטה החודר של תודעתי."),
            LovePhrase("19897A95-537E-4E31-B5D1-9665B65AF86B", "אם אני שמש אז את הירח, אורי משתקף בעורך החלק. יום הופך ללילה, וויכוח הופך לאהבה לוהטת, כזה הוא המחזור של האהבה. נראה שנולדנו, איש ואישה, אל תוך קטבים שימשיכו להעביר ביניהם מילים ותחושות ואינטימיות עד אותו יום עלום בו הרוח תרחף מאיתנו והלאה."),
            LovePhrase("632B7F14-8147-4CC4-871D-3AC550282C15", "אני כאן ואת שם, וכשיפגשו זרועותינו פעם נוספת נדע כי בני זוג אנחנו, רוקמים את הברית חזור ורקום. היא תבנה לנו בית ומשפחה וקהילה מסביב. החיים נפרשים בעוד היא מתחזקת, צועדת בשביל בעל קצוות עלומים, נושקים אל סוף הימים."),
            LovePhrase("5DE80425-7404-476E-B85A-53B551B02AA0", "מכל הנופים שבנפש, לך יש את הטקסטורה הנאה ביותר. את נחל זורם, מוקף צמחייה, מעניק חיים. לעיתים עדינה ורוגעת, לעיתים שוצפת בעוצמה, אך מהותך תמיד בתנועה. ואני לוגם מן המים הצלולים, הזכים, ונפשי מוצאת מרגוע וחום בשפע שזורם מתוכך אליי ואל הסביבה כולה."),
            LovePhrase("BC0A66E8-CB12-46F6-9753-B53CF6B5045F", "הלבבות שלנו מתרחבים ומתכווצים לסירוגין במערכת היחסים האינטנסיבית ביותר שידענו.החיים לצידך מלאים בהתרחשות, במוזיקה, בשיחות, בתובנה. אני מודה לך שוב על ההזדמנות שנתת לי, להיות כאן בשבילך, וללמוד ממך את האמנות העדינה של התחשבות, של נתינת כבוד ושל איכפתיות מבת הזוג הנהדרת שלי."),
            LovePhrase("1BD1FA36-C2FC-43CA-B2C0-35B3E9F988FB", "שאלת אותי פעם אם אני אוהב לישון לצידך, ורצית להשיב. בכל בוקר בו אנו מתעוררים ואת מחבקת אותי, בכל פעם שאני מלטף את שערך, את הגב, את הפנים, יש בי אושר של אדם שיודע שאישה אמיתית נמצאת לצידו. חיוכך השמח, המקדש של גופך, הם שער הכניסה שלי לעולם של עונג, של צורות וצבעים וטעמים. בזכותך, חוויית החיים נהיית חזקה יותר ברורה יותר, מוחשית מכל דרך אחרת בה .אצעד לבדי. את מחזירה אותי תמיד אל הרגש ואל הידיעה של הגוף ועל כך אני מודה לך מעומק ליבי"),
            LovePhrase("1F0FFA05-0A4D-4675-A8A9-36522D688B12", "ביני ובין עצמי אני תוהה מה זה אומר שאת הנסיכה שלי. אני חושב שאלו כל אותם הדברים והמעשים שגורמים לי לרצות להיות האביר שלך. בכל בקשה או חיוך או אתגר שתעמידי בפניי עומדת לי האפשרות להיות שם בשבילך, לממש את הרצון להעניק לך את מתנות אהבתי. חלק מהמתנות הן תוצאה של החלטה מיידית ונכונה, וחלקן דורשות הכנה ועקביות רבה, אך המשותף לכולן שהן תולדה של מה שנוכחותך מעוררת בי. נוכחותך האוהבת מוציאה ממני את הרצון לעשות את העולם ואת עצמי טובים יותר, למענך, למען המשפחה שלנו, ובתקווה שגם למען העולם כולו."),
            LovePhrase("FDC8E543-86A2-410D-9508-3E3FCB319F6F", "אני הוא זה שמחבק אותך בלילה, שכן בחרתי להיות הגבר שעל חזהו תניחי את ראשך. וכשאני חש את עור גופך הרך מתחכך על עורי שלי, העונג פשוט אצלי בגוף, ואני יודע שעשיתי את הבחירה הנכונה."),
            LovePhrase("8961C24A-0746-4A90-9B84-D4037CCA0AEC", "גם ברגעים של עצבות, ואולי במיוחד ברגעים של עצבות, ובייחוד באלו שעוברים בינינו, אני מבין עד כמה את חשובה לי. חווינו יחד קשיים ואתגרים רבים, ובכל פעם שהם התקרבו לנקודת הרתיחה, הרגשתי בעוצמה את העצב שבלאבד אותך, גם אם לא הפגנתי אותו באופן ברור. את יקרה לי מאוד, הקשר שלנו הוא אחד מעמודי הטווח היפים והחשובים בחיי, והידיעה שהוא חשוב גם לך מפייסת את ליבי כשהוא דואב."),
            LovePhrase("996DDEA0-575A-400E-828B-089028416B0C", "לקום ולראות אותך מחייכת בבוקר זו זכות גדולה. כמו לקבל משקה מרענן בתחילתו של יום. לחיוך שלך יש אלמנט מרגיע ומשובב נפש, הוא מראה לי שאת מרגישה טוב. וכשאת מרגישה טוב השמחה שלך מפעפעת אל תוך נימי נפשי, ואט אט מחלחלת אל תוך ליבי."),
            LovePhrase("1D2D1B35-CFDD-41E7-8F3B-DEE27E104974", "כשאני ממלא אותך את מחזירה לי כפליים, כביסה ואוכל ובית נקי הם רק תופעות לוואי שיוצאות מתך המקור שלך, שהוא בבסיסו, אהבה ראשונית, זורמת, מלטפת, חיננית וסוערת. זוהי אותה אהבה שבשבילה אני מוכן ללכת מרחקים רבים שבנפש, ואליה אני חוזר בכל יום מחדש."),
            LovePhrase("3AC2ACD1-D896-4490-B75F-31412B4AFE26", "שיריי נכתבים בשבילך, והסיפורים שואבים ממך השראה. כאשר אני נסוג אל תוך עולמי הפנימי את תמיד מופיעה שם שוב, מבפנים ומבחוץ, להזכיר לי את ההתחייבות שלי. אני רוצה להיות כאן בשבילך תמיד, אביר נשוי לנסיכה מחייכת עם שיער רקום כמשי."),
            LovePhrase("DB87D9E3-3A5A-4B77-8EFA-A633D02E4C08", "את מביטה אליי בשיער גולש, בלחיים מלאות חן, בעיניים מצפות, מלאות באמון. אני מביט בך בחזרה, הריקות שאני חש עוטפת את מי שאת. אני אוהב להיות המיכל שלך, להתמלא בנופת העסיסי שעוד רגע ותסחטי לתוכי. אין זה פלא שחפצה נפשי להישאר איתך לעולמי עולמים."),
            LovePhrase("228FECB4-C42C-42A2-BCA9-8265C847834E", "החיוך שלך מאיר לי את היום, הוא מלא בחלקים שלך, ביופי שלך השוכן מעבר לכל המילים. כאשר אני עובר בשבילי חיי את כמו מתנה פועמת, צפונה בליבי, מגיעה איתי לכל מקום, מעלה אצלי לפחות עוד חיוך שמתגלגל אל תוך העולם."),
            LovePhrase("A4BF4D59-96E2-4A39-B5D7-642879ED1E86", "אני מדמיין אותך כמו אוקיינוס של תחושות, של התרחשויות, של אנרגיה, גועשת ומלטפת, ואני סירה השטה בין הגלים שלך. הסירה עושה אהבה עם האוקיינוס, והוא בתמורה ממלא אותה בכוח הגלים שלו, ועוזר לה להגיע אל הצד השני. ."),
            LovePhrase("2A3B7795-ADC9-4B85-82C9-3BBCA5F766D6", "מיני תחושות עוברות ממך אליי וחוזרות בחזרה, בזוגיות של השתקפויות הדדיות. אני אוהב אותך כי את משקפת לי חלקים בתוכי, מפתחת אותי, גורמת לי להיות אדם טוב יותר."),
            LovePhrase("3576E02C-0A32-45AB-B7CF-BDB5F81F381E", "אנשים אוהבים לכתוב ש\"אין להם מילים לתאר משהו נפלא\", אך לי דווקא יש את המילים. האהבה שלי אלייך לובשת צורות רבות, וצבעים רבים וריחות וכוכבים שמסתדרים להם בשמיים, שרים את המנגינה של שנינו."),
            LovePhrase("AED1D218-30F7-499F-BDB0-A1D9289F1CAA", "את נהר של תחושות, של פרחים מלבלבים, חידה של תשוקה שיש לפתור אותה, אם רק אצליח אהבתנו תגדל מעבר לכל הדמיונות שלנו."),
            LovePhrase("0BE680D4-8B2B-4914-92C1-6A06ABAA2906", "אני יודע שאת שלי, חוטים בלתי נראים מחברים בין הלב שלי לשלך, והקשר בינינו מורגש אצלך לאורך היום, גם כשאנחנו לא מדברים. בחיבור שבינינו מעורר אותי לחיים, אני רוצה שתהיי שלי לתמיד."),
            LovePhrase("83CCF85A-BC71-4189-BAC9-F8A2F469A5C0", "אני אוהב אותך כמו שאת, עם השמחה, השיחה העמוקה, האינטימיות, העצב, המחויבות, הבשמים, החיבוקים בלילה, הקשיים והרגעים היפים ביותר. את החלק בחיים שלי שפותח לי את הלב עוד ועוד, עד לאינסוף."),
            LovePhrase("0FB45BD3-0807-489F-8AEC-CF9283CA3011", "את מתנה שקיבלתי, ברכה שהגיעה אליי בצורה של אנרגיה נשית שופעת. את סקסית, עם חיוך מתוק ושיער ארוך, ליופי שלך יש קסם משלו."),
            LovePhrase("FBD9C2DB-02E9-4845-87F0-702B0E77D30D", "אני חושב עלייך ויודע שאת האישה בשבילי. את עוזרת לי להפוך לאדם טוב יותר, ולאורך הזמן גיליתי על עצמי המון דברים, בזכותך."),
            LovePhrase("08F109F5-0843-4191-90FC-653BCB6A98FC", "גם ברגעים הכי קשים שלנו, את תמיד מצאת את דרכך, והיית גם מוכנה להושיט יד ולקבל את היד המושטת שלי, וזה מראה על עוצמת הקשר, זה מחבר בינינו.")
    )

    private val closures = mutableListOf(
            LoveClosure("4B9BEB6B-5E16-46EF-BBF1-14ACBC9AC0A9", "הלב שלי שלך\u2066❤️\u2069"),
            LoveClosure("5EA7E6BE-5235-4FFA-B31F-1E3F58BF38F3", "החתול שלך"),
            LoveClosure("DD5CE74F-71DF-4656-9304-76AF5A390F73", "אני ❤️"),
            LoveClosure("EB74FB15-DA4F-4E10-8EA3-338126B88E17", "אני אוהב אותך מתוקה שלי"),
            LoveClosure("AR74FB24-AS4F-4G10-8EA3-562789B88E53", "הגמל שלך"),
            LoveClosure("EEC2799D-5988-4E73-914E-DA59C1AB2469", "אני מודה לך."),
            LoveClosure("5E47D20D-7882-443F-9817-6748E42CD563", "מודה על מה שיש בינינו"),
            LoveClosure("8AA0D780-6582-42D9-8ED1-17423EE25959", "תודה על מי שאת."),
            LoveClosure("7979C795-31FD-46D2-90A8-907EE43FF5D8", "וואלה, זכיתי."),
            LoveClosure("EFC0A18A-A15B-4448-B4E7-F3C0BFE247B1", "אוהב,גמל השלמה שלך."),
            LoveClosure("29B9D2D6-BBCA-415F-ADF6-24E81AC5CF20", "אוהב אותך מיליון, הקיבוצניק שלך."),
            LoveClosure("49F99E23-781A-4745-BFB4-8E92F0937EFD", "לולו שלך."),
            LoveClosure("0E42280C-045E-4C56-AD14-DDC19246EBA9", "מתגעגע, גם אם אני כבר כאן."),
            LoveClosure("3E30D793-59BE-480B-B2C5-FAD393751A62", "אוהב אותך, אריאל."),
            LoveClosure("E15A0148-3B89-4A22-A2F1-E6CC37A214D4", "הלולר שלך."),
            LoveClosure("93E556C8-7BB0-4A72-832F-9513A7F1D88F", "מצפה לך שוב."),
            LoveClosure("84E3B08F-F13B-4895-AE15-247F3271966E", "שלך באהבה גדולה."),
            LoveClosure("4DFD5504-200E-4565-9947-631C6F5E8E50", "פישוטו שלך."),
            LoveClosure("BE6857CE-C26C-4D6F-BD96-B269E11718B1", "אוהב האביר שלך."),
            LoveClosure("15CCA8F8-0406-4CD5-8542-0F278DCCD8DF", "שושו שלך."),
            LoveClosure("6D1A75C6-5229-4407-8D85-F12208392BED", "אני אוהב אותך, אריאל."),
            LoveClosure("1C74D0F1-78CF-4749-BC9D-751454E97464", "שלך באהבה מתוקה, הנסיך שלך."),
            LoveClosure("E68A6EA0-7E9D-45A8-AEED-ED6261D9F11F", "מרגיש אותך, אריאל."),
            LoveClosure("5124CBF9-3250-43F4-8EA0-626660580D8F", "שלך תמיד, הגבר שלך."),
            LoveClosure("EFB4BB35-C45E-4C3E-9A17-689B9F2BE172", "אוהב, פישוטו שלך."),
            LoveClosure("420A8365-4523-49B0-BCE8-DA17196C753C", "אוהב ומחכה לך, הגבר שלך."),
            LoveClosure("84F53130-A49D-436B-9FB5-A3908EB9A9F6", "תמיד איתך ותודה על מי שאת."),
            LoveClosure("5AAFB6BD-8DA5-4309-B296-3B15078D6186", "שלך תמיד."),
            LoveClosure("ECDA7590-2F96-4D83-9FCB-242523D193F3", "שלך לנצח."),
            LoveClosure("MORE6330-5L96-1D23-6GDB-489590B565F4", "התנור שלך ;-)"))

    init {
        letters.addAll(DefaultLoveDataSet.getLetters())
        phrases.forEach(){
            letters.add(generateRandomLetter(it))
        }
    }

    private fun generateRandomLetter(lovePhrase: LovePhrase): LoveLetter {
        var text = ""
        var opener = LoveOpener()
        var closure = LoveClosure()

        opener = openers.randomOrNull() ?: opener
        text = text.plus(opener.text + "\n\n")

        text = text.plus(lovePhrase.text + "\n\n")

        closure = closures.randomOrNull() ?: closure
        text = text.plus(closure.text + "\n\n")

        val id = opener.id.plus(lovePhrase.id).plus(closure.id)

        val letter = LoveLetter(id, text)
        return letter
    }


    override fun getLetters(): MutableList<LoveLetter> {
        return letters
    }
}